# Final dummification
    - so far :
    - Selected most useful Make and Model by counting groupped data
    - Reduced 1048575 rows to 263310 total rows
    - Reduced 60 makes to 16 makes, 4395 models to 126 mod
    - Dropped temporary used columns

In [1]:
# continue data dummification from dummification 2
# Import basic necessities
import pandas as pd
import numpy as np
import os

import warnings
warnings.filterwarnings('ignore')

In [2]:
data_file = "data/driver_vehicle.csv"
driver_vehicle_df = pd.read_csv(data_file)

In [3]:
driver_vehicle_df.head()

   GENDER  CREDIT_SCORE  AGE  YEAR   MAKE        MODEL
0       0           824   32  2016  DODGE  JOURNEY SXT
1       0           824   29  2016  DODGE  JOURNEY SXT
2       0           631   28  2016  DODGE  JOURNEY SXT
3       0           666   28  2016  DODGE  JOURNEY SXT
4       0           671   39  2016  DODGE  JOURNEY SXT

In [4]:
driver_vehicle_df.dtypes

GENDER           int64
CREDIT_SCORE     int64
AGE              int64
YEAR             int64
MAKE            object
MODEL           object
dtype: object

In [5]:
# AS TA recommended let's use model for first words
driver_vehicle_df['MODEL'] = driver_vehicle_df.MODEL.str.split().str.get(0)

In [6]:
driver_vehicle_df.head()

   GENDER  CREDIT_SCORE  AGE  YEAR   MAKE    MODEL
0       0           824   32  2016  DODGE  JOURNEY
1       0           824   29  2016  DODGE  JOURNEY
2       0           631   28  2016  DODGE  JOURNEY
3       0           666   28  2016  DODGE  JOURNEY
4       0           671   39  2016  DODGE  JOURNEY

In [7]:
driver_vehicle_df =driver_vehicle_df[~driver_vehicle_df.isin([np.nan, np.inf, -np.inf]).any(1)]

In [8]:
# I see outliers or zero - Removing it
driver_vehicle_df = driver_vehicle_df[driver_vehicle_df['CREDIT_SCORE'] > 0]

In [9]:
driver_vehicle_df = driver_vehicle_df[(driver_vehicle_df["AGE"] < 100) & (driver_vehicle_df["AGE"] > 16)]
len(driver_vehicle_df)

262419

In [10]:
driver_vehicle_df[(driver_vehicle_df["AGE"] > 100)]

Empty DataFrame
Columns: [GENDER, CREDIT_SCORE, AGE, YEAR, MAKE, MODEL]
Index: []

In [11]:
driver_vehicle_df.to_csv("data/web_interact.csv", index=False)

In [12]:
driver_vehicle_df['MODEL'].unique()

array(['JOURNEY', 'TOWN', 'EXPLORER', 'SONIC', 'IMPALA', 'ELANTRA',
       'SENTRA', 'ESCAPE', '1500', 'SONATA', 'PATRIOT', 'F-150',
       'TRAVERSE', 'CHARGER', 'GRAND', 'CR-V', 'CAMRY', 'CRUZE',
       'COROLLA', 'ACCORD', 'MUSTANG', 'MALIBU', 'ROGUE', 'WRANGLER',
       'F-250', 'FUSION', 'SILVERADO', 'EQUINOX', 'ALTIMA', 'CHEROKEE',
       'ENCORE', 'COMPASS', 'SORENTO', 'OPTIMA', 'SPARK', 'DART',
       'RENEGADE', 'EDGE', 'RAV4', 'FIESTA', '200', 'CAMARO', 'FOCUS',
       'CIVIC', 'SOUL', 'PATHFINDER', 'AVENGER', 'TRAX', 'FORTE',
       'TERRAIN', 'ACCENT', 'MAXIMA', 'CHALLENGER', 'TAURUS', 'VERSA',
       'MURANO', 'RX', 'PRIUS', 'MKZ', 'SPTAGE', 'C'], dtype=object)

In [13]:
dummy_cols = ['YEAR', 'MAKE', 'MODEL']
driver_vehicle_df = pd.get_dummies(driver_vehicle_df, columns=dummy_cols)

In [14]:
driver_vehicle_df.head()

,GENDER,CREDIT_SCORE,AGE,YEAR_2010,YEAR_2011,YEAR_2012,YEAR_2013,YEAR_2014,YEAR_2015,YEAR_2016,...,MODEL_SOUL,MODEL_SPARK,MODEL_SPTAGE,MODEL_TAURUS,MODEL_TERRAIN,MODEL_TOWN,MODEL_TRAVERSE,MODEL_TRAX,MODEL_VERSA,MODEL_WRANGLER
0,0,824,32,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
1,0,824,29,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
2,0,631,28,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
3,0,666,28,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
4,0,671,39,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0

In [15]:
driver_vehicle_df.columns

Index(['GENDER', 'CREDIT_SCORE', 'AGE', 'YEAR_2010', 'YEAR_2011', 'YEAR_2012',
       'YEAR_2013', 'YEAR_2014', 'YEAR_2015', 'YEAR_2016', 'YEAR_2017',
       'YEAR_2018', 'YEAR_2019', 'YEAR_2020', 'YEAR_2021', 'YEAR_2022',
       'MAKE_BUICK', 'MAKE_CHEVROLET', 'MAKE_CHRYSLER', 'MAKE_DODGE',
       'MAKE_FORD', 'MAKE_GMC', 'MAKE_HONDA', 'MAKE_HYUNDAI', 'MAKE_JEEP',
       'MAKE_KIA', 'MAKE_LEXUS', 'MAKE_LINCOLN', 'MAKE_MERCEDES-BENZ',
       'MAKE_NISSAN', 'MAKE_RAM', 'MAKE_TOYOTA', 'MODEL_1500', 'MODEL_200',
       'MODEL_ACCENT', 'MODEL_ACCORD', 'MODEL_ALTIMA', 'MODEL_AVENGER',
       'MODEL_C', 'MODEL_CAMARO', 'MODEL_CAMRY', 'MODEL_CHALLENGER',
       'MODEL_CHARGER', 'MODEL_CHEROKEE', 'MODEL_CIVIC', 'MODEL_COMPASS',
       'MODEL_COROLLA', 'MODEL_CR-V', 'MODEL_CRUZE', 'MODEL_DART',
       'MODEL_EDGE', 'MODEL_ELANTRA', 'MODEL_ENCORE', 'MODEL_EQUINOX',
       'MODEL_ESCAPE', 'MODEL_EXPLORER', 'MODEL_F-150', 'MODEL_F-250',
       'MODEL_FIESTA', 'MODEL_FOCUS', 'MODEL_FORTE', 'MODEL_FUSION',
       'MODEL_GRAND', 'MODEL_IMPALA', 'MODEL_JOURNEY', 'MODEL_MALIBU',
       'MODEL_MAXIMA', 'MODEL_MKZ', 'MODEL_MURANO', 'MODEL_MUSTANG',
       'MODEL_OPTIMA', 'MODEL_PATHFINDER', 'MODEL_PATRIOT', 'MODEL_PRIUS',
       'MODEL_RAV4', 'MODEL_RENEGADE', 'MODEL_ROGUE', 'MODEL_RX',
       'MODEL_SENTRA', 'MODEL_SILVERADO', 'MODEL_SONATA', 'MODEL_SONIC',
       'MODEL_SORENTO', 'MODEL_SOUL', 'MODEL_SPARK', 'MODEL_SPTAGE',
       'MODEL_TAURUS', 'MODEL_TERRAIN', 'MODEL_TOWN', 'MODEL_TRAVERSE',
       'MODEL_TRAX', 'MODEL_VERSA', 'MODEL_WRANGLER'],
      dtype='object')

In [16]:
driver_vehicle_df.to_csv("data/dummified_data.csv", index=False)